## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_management_group.mg_miszel will be created
  + resource "azurerm_management_group" "mg_miszel" {
      + display_name               = "mg-miszel"
      + id                         = (known after apply)
      + name                       = (known after apply)
      + parent_management_group_id = (known after apply)
      + subscription_ids           = (known after apply)
    }

  # azurerm_management_group.mg_platform will be created
  + resource "azurerm_management_group" "mg_platform" {
      + display_name               = "mg-platform"
      + id                         = (known after apply)
      + name                       = (known after apply)
      + parent_management_group_id = (known after apply)
      + subscription_ids           = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>